{
    "format": "layers-model",
    "generatedBy": "keras v3.8.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "3.8.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "functional",
                "trainable": true,
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batchInputShape": [
                                null,
                                128,
                                128,
                                3
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "name": "input_layer"
                        },
                        "name": "input_layer",
                        "inbound_nodes": [
                            [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    128,
                                                    128,
                                                    3
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "input_layer",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 16,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d",
                        "inbound_nodes": [
                            [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    128,
                                                    128,
                                                    3
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "input_layer",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling2d",
                        "inbound_nodes": [
                            [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    128,
                                                    128,
                                                    16
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "conv2d",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 32,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_1",
                        "inbound_nodes": [
                            [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    64,
                                                    64,
                                                    16
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "max_pooling2d",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling2d_1",
                        "inbound_nodes": [
                            [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    64,
                                                    64,
                                                    32
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "conv2d_1",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_2",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_2",
                        "inbound_nodes": [
                            [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    32,
                                                    32,
                                                    32
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "max_pooling2d_1",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_2",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling2d_2",
                        "inbound_nodes": [
                            [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    32,
                                                    32,
                                                    64
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "conv2d_2",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_3",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 128,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_3",
                        "inbound_nodes": [
                            [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    16,
                                                    16,
                                                    64
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "max_pooling2d_2",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_3",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling2d_3",
                        "inbound_nodes": [
                            [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    16,
                                                    16,
                                                    128
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "conv2d_3",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        ]
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "data_format": "channels_last"
                        },
                        "name": "flatten",
                        "inbound_nodes": [
                            [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    8,
                                                    8,
                                                    128
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "max_pooling2d_3",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 64,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense",
                        "inbound_nodes": [
                            [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    8192
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "flatten",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        ]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.3,
                            "seed": null,
                            "noise_shape": null
                        },
                        "name": "dropout",
                        "inbound_nodes": [
                            [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    64
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "dense",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {
                                        "training": false
                                    }
                                }
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 128,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_1",
                        "inbound_nodes": [
                            [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    64
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "dropout",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        ]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.5,
                            "seed": null,
                            "noise_shape": null
                        },
                        "name": "dropout_1",
                        "inbound_nodes": [
                            [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    128
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "dense_1",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {
                                        "training": false
                                    }
                                }
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "bbox",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 4,
                            "activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "bbox",
                        "inbound_nodes": [
                            [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    128
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "dropout_1",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "class",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 26,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "class",
                        "inbound_nodes": [
                            [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    128
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "dropout_1",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "input_layer",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "bbox",
                        0,
                        0
                    ],
                    [
                        "class",
                        0,
                        0
                    ]
                ]
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "bbox/kernel",
                    "shape": [
                        128,
                        4
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bbox/bias",
                    "shape": [
                        4
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "class/kernel",
                    "shape": [
                        128,
                        26
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "class/bias",
                    "shape": [
                        26
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d/kernel",
                    "shape": [
                        3,
                        3,
                        3,
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d/bias",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_1/kernel",
                    "shape": [
                        3,
                        3,
                        16,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_1/bias",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_2/kernel",
                    "shape": [
                        3,
                        3,
                        32,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_2/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_3/kernel",
                    "shape": [
                        3,
                        3,
                        64,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_3/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/kernel",
                    "shape": [
                        8192,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/kernel",
                    "shape": [
                        64,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}